#!/bin/bash
echo "🚀 Начинаю обновление..."

# 1. Переход в папку
cd /var/www/lg110 || exit

# 2. Скачивание
echo "📥 Скачиваю с GitHub..."
git pull

# 3. Сборка Фронта
echo "🎨 Собираю Админку..."
npm install
npm run build

# 4. Обновление файлов сервера
echo "📦 Копирую файлы..."
mkdir -p server/public
cp -r dist/* server/public/

# 5. Обновление Бэка
echo "⚙️ Обновляю Сервер..."
cd server
npm install
npx prisma generate
npx prisma db push

# 6. Перезапуск
echo "🔄 Перезагружаю бота..."
pm2 restart lg110-bot

echo "✅ ГОТОВО! Бот обновлен."
